Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: وما خلقنا السماء والأرض وما بينهما لاعبين
en: And We did not create the heaven and earth and that between them in play.

source: لو أردنا أن نتخذ لهوا لاتخذناه من لدنا إن كنا فاعلين
en: Had We intended to take a diversion, We could have taken it from [what is] with Us - if [indeed] We were to do so.

source: بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق ولكم الويل مما تصفون
en: Rather, We dash the truth upon falsehood, and it destroys it, and thereupon it departs. And for you is destruction from that which you describe.

source: وله من في السماوات والأرض ومن عنده لا يستكبرون عن عبادته ولا يستحسرون
en: To Him belongs whoever is in the heavens and the earth. And those near Him are not prevented by arrogance from His worship, nor do they tire.

source: يسبحون الليل والنهار لا يفترون
en: They exalt [Him] night and day [and] do not slacken.

source: أم اتخذوا آلهة من الأرض هم ينشرون
en: Or have men taken for themselves gods from the earth who resurrect [the dead]?

source: لو كان فيهما آلهة إلا الله لفسدتا فسبحان الله رب العرش عما يصفون
en: Had there been within the heavens and earth gods besides Allah, they both would have been ruined. So exalted is Allah, Lord of the Throne, above what they describe.

source: لا يسأل عما يفعل وهم يسألون
en: He is not questioned about what He does, but they will be questioned.

source: أم اتخذوا من دونه آلهة قل هاتوا برهانكم هذا ذكر من معي وذكر من قبلي بل أكثرهم لا يعلمون الحق فهم معرضون
en: Or have they taken gods besides Him? Say, [O Muhammad], "Produce your proof. This [Qur'an] is the message for those with me and the message of those before me." But most of them do not know the truth, so they are turning away.

source: وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون
en: And We sent not before you any messenger except that We revealed to him that, "There is no deity except Me, so worship Me."

source: وقالوا اتخذ الرحمن ولدا سبحانه بل عباد مكرمون
en: And they say, "The Most Merciful has taken a son." Exalted is He! Rather, they are [but] honored servants.

source: لا يسبقونه بالقول وهم بأمره يعملون
en: They cannot precede Him in word, and they act by His command.

source: يعلم ما بين أيديهم وما خلفهم ولا يشفعون إلا لمن ارتضى وهم من خشيته مشفقون
en: He knows what is [presently] before them and what will be after them, and they cannot intercede except on behalf of one whom He approves. And they, from fear of Him, are apprehensive.

source: ومن يقل منهم إني إله من دونه فذلك نجزيه جهنم كذلك نجزي الظالمين
en: And whoever of them should say, "Indeed, I am a god besides Him"- that one We would recompense with Hell. Thus do We recompense the wrongdoers.

source: أولم ير الذين كفروا أن السماوات والأرض كانتا رتقا ففتقناهما وجعلنا من الماء كل شيء حي أفلا يؤمنون
en: Have those who disbelieved not considered that the heavens and the earth were a joined entity, and We separated them and made from water every living thing? Then will they not believe?

source: وجعلنا في الأرض رواسي أن تميد بهم وجعلنا فيها فجاجا سبلا لعلهم يهتدون
en: And We placed within the earth firmly set mountains, lest it should shift with them, and We made therein [mountain] passes [as] roads that they might be guided.

source: وجعلنا السماء سقفا محفوظا وهم عن آياتها معرضون
en: And We made the sky a protected ceiling, but they, from its signs, are turning away.

source: وهو الذي خلق الليل والنهار والشمس والقمر كل في فلك يسبحون
en: And it is He who created the night and the day and the sun and the moon; all [heavenly bodies] in an orbit are swimming.

source: وما جعلنا لبشر من قبلك الخلد أفإن مت فهم الخالدون
en: And We did not grant to any man before you eternity [on earth]; so if you die - would they be eternal?

source: كل نفس ذائقة الموت ونبلوكم بالشر والخير فتنة وإلينا ترجعون
en: Every soul will taste death. And We test you with evil and with good as trial; and to Us you will be returned.

source: وإذا رآك الذين كفروا إن يتخذونك إلا هزوا أهذا الذي يذكر آلهتكم وهم بذكر الرحمن هم كافرون
en: And when those who disbelieve see you, [O Muhammad], they take you not except in ridicule, [saying], "Is this the one who insults your gods?" And they are, at the mention of the Most Merciful, disbelievers.

source: خلق الإنسان من عجل سأريكم آياتي فلا تستعجلون
en: Man was created of haste. I will show you My signs, so do not impatiently urge Me.

source: لو يعلم الذين كفروا حين لا يكفون عن وجوههم النار ولا عن ظهورهم ولا هم ينصرون
en: If those who disbelieved but knew the time when they will not avert the Fire from their faces or from their backs and they will not be aided...

source: بل تأتيهم بغتة فتبهتهم فلا يستطيعون ردها ولا هم ينظرون
en: Rather, it will come to them unexpectedly and bewilder them, and they will not be able to repel it, nor will they be reprieved.

source: قل من يكلؤكم بالليل والنهار من الرحمن بل هم عن ذكر ربهم معرضون
en: Say, "Who can protect you at night or by day from the Most Merciful?" But they are, from the remembrance of their Lord, turning away.

source: أم لهم آلهة تمنعهم من دوننا لا يستطيعون نصر أنفسهم ولا هم منا يصحبون
en: Or do they have gods to defend them other than Us? They are unable [even] to help themselves, nor can they be protected from Us.

source: بل متعنا هؤلاء وآباءهم حتى طال عليهم العمر أفلا يرون أنا نأتي الأرض ننقصها من أطرافها أفهم الغالبون
en: But, [on the contrary], We have provided good things for these [disbelievers] and their fathers until life was prolonged for them. Then do they not see that We set upon the land, reducing it from its borders? So it is they who will overcome?

source: قل إنما أنذركم بالوحي ولا يسمع الصم الدعاء إذا ما ينذرون
en: Say, "I only warn you by revelation." But the deaf do not hear the call when they are warned.

source: ولئن مستهم نفحة من عذاب ربك ليقولن يا ويلنا إنا كنا ظالمين
en: And if [as much as] a whiff of the punishment of your Lord should touch them, they would surely say, "O woe to us! Indeed, we have been wrongdoers."

source: ونضع الموازين القسط ليوم القيامة فلا تظلم نفس شيئا وإن كان مثقال حبة من خردل أتينا بها وكفى بنا حاسبين
en: And We place the scales of justice for the Day of Resurrection, so no soul will be treated unjustly at all. And if there is [even] the weight of a mustard seed, We will bring it forth. And sufficient are We as accountant.

source: ولقد آتينا موسى وهارون الفرقان وضياء وذكرا للمتقين
en: And We had already given Moses and Aaron the criterion and a light and a reminder for the righteous

source: الذين يخشون ربهم بالغيب وهم من الساعة مشفقون
en: Who fear their Lord unseen, while they are of the Hour apprehensive.

source: وهذا ذكر مبارك أنزلناه أفأنتم له منكرون
en: And this [Qur'an] is a blessed message which We have sent down. Then are you with it unacquainted?

source: ولقد آتينا إبراهيم رشده من قبل وكنا به عالمين
en: And We had certainly given Abraham his sound judgement before, and We were of him well-Knowing

source: إذ قال لأبيه وقومه ما هذه التماثيل التي أنتم لها عاكفون
en: When he said to his father and his people, "What are these statues to which you are devoted?"

source: قالوا وجدنا آباءنا لها عابدين
en: They said, "We found our fathers worshippers of them."

source: قال لقد كنتم أنتم وآباؤكم في ضلال مبين
en: He said, "You were certainly, you and your fathers, in manifest error."

source: قالوا أجئتنا بالحق أم أنت من اللاعبين
en: They said, "Have you come to us with truth, or are you of those who jest?"

source: قال بل ربكم رب السماوات والأرض الذي فطرهن وأنا على ذلكم من الشاهدين
en: He said, "[No], rather, your Lord is the Lord of the heavens and the earth who created them, and I, to that, am of those who testify.

source: وتالله لأكيدن أصنامكم بعد أن تولوا مدبرين
en: And [I swear] by Allah, I will surely plan against your idols after you have turned and gone away."

source: فجعلهم جذاذا إلا كبيرا لهم لعلهم إليه يرجعون
en: So he made them into fragments, except a large one among them, that they might return to it [and question].

source: قالوا من فعل هذا بآلهتنا إنه لمن الظالمين
en: They said, "Who has done this to our gods? Indeed, he is of the wrongdoers."

source: قالوا سمعنا فتى يذكرهم يقال له إبراهيم
en: They said, "We heard a young man mention them who is called Abraham."

source: قالوا فأتوا به على أعين الناس لعلهم يشهدون
en: They said, "Then bring him before the eyes of the people that they may testify."

source: قالوا أأنت فعلت هذا بآلهتنا يا إبراهيم
en: They said, "Have you done this to our gods, O Abraham?"

source: قال بل فعله كبيرهم هذا فاسألوهم إن كانوا ينطقون
en: He said, "Rather, this - the largest of them - did it, so ask them, if they should [be able to] speak."

source: فرجعوا إلى أنفسهم فقالوا إنكم أنتم الظالمون
en: So they returned to [blaming] themselves and said [to each other], "Indeed, you are the wrongdoers."

source: ثم نكسوا على رءوسهم لقد علمت ما هؤلاء ينطقون
en: Then they reversed themselves, [saying], "You have already known that these do not speak!"

source: قال أفتعبدون من دون الله ما لا ينفعكم شيئا ولا يضركم
en: He said, "Then do you worship instead of Allah that which does not benefit you at all or harm you?

source: أف لكم ولما تعبدون من دون الله أفلا تعقلون
en: Uff to you and to what you worship instead of Allah. Then will you not use reason?"

source: قالوا حرقوه وانصروا آلهتكم إن كنتم فاعلين
en: They said, "Burn him and support your gods - if you are to act."

source: قلنا يا نار كوني بردا وسلاما على إبراهيم
en: Allah said, "O fire, be coolness and safety upon Abraham."

source: وأرادوا به كيدا فجعلناهم الأخسرين
en: And they intended for him harm, but We made them the greatest losers.

source: ونجيناه ولوطا إلى الأرض التي باركنا فيها للعالمين
en: And We delivered him and Lot to the land which We had blessed for the worlds.

source: ووهبنا له إسحاق ويعقوب نافلة وكلا جعلنا صالحين
en: And We gave him Isaac and Jacob in addition, and all [of them] We made righteous.

source: وجعلناهم أئمة يهدون بأمرنا وأوحينا إليهم فعل الخيرات وإقام الصلاة وإيتاء الزكاة وكانوا لنا عابدين
en: And We made them leaders guiding by Our command. And We inspired to them the doing of good deeds, establishment of prayer, and giving of zakah; and they were worshippers of Us.

source: ولوطا آتيناه حكما وعلما ونجيناه من القرية التي كانت تعمل الخبائث إنهم كانوا قوم سوء فاسقين
en: And to Lot We gave judgement and knowledge, and We saved him from the city that was committing wicked deeds. Indeed, they were a people of evil, defiantly disobedient.

source: وأدخلناه في رحمتنا إنه من الصالحين
en: And We admitted him into Our mercy. Indeed, he was of the righteous.

source: ونوحا إذ نادى من قبل فاستجبنا له فنجيناه وأهله من الكرب العظيم
en: And [mention] Noah, when he called [to Allah] before [that time], so We responded to him and saved him and his family from the great flood.

source: ونصرناه من القوم الذين كذبوا بآياتنا إنهم كانوا قوم سوء فأغرقناهم أجمعين
en: And We saved him from the people who denied Our signs. Indeed, they were a people of evil, so We drowned them, all together.

source: وداوود وسليمان إذ يحكمان في الحرث إذ نفشت فيه غنم القوم وكنا لحكمهم شاهدين
en: And [mention] David and Solomon, when they judged concerning the field - when the sheep of a people overran it [at night], and We were witness to their judgement.

source: ففهمناها سليمان وكلا آتينا حكما وعلما وسخرنا مع داوود الجبال يسبحن والطير وكنا فاعلين
en: And We gave understanding of the case to Solomon, and to each [of them] We gave judgement and knowledge. And We subjected the mountains to exalt [Us], along with David and [also] the birds. And We were doing [that].

source: وعلمناه صنعة لبوس لكم لتحصنكم من بأسكم فهل أنتم شاكرون
en: And We taught him the fashioning of coats of armor to protect you from your [enemy in] battle. So will you then be grateful?

source: ولسليمان الريح عاصفة تجري بأمره إلى الأرض التي باركنا فيها وكنا بكل شيء عالمين
en: And to Solomon [We subjected] the wind, blowing forcefully, proceeding by his command toward the land which We had blessed. And We are ever, of all things, Knowing.

source: ومن الشياطين من يغوصون له ويعملون عملا دون ذلك وكنا لهم حافظين
en: And of the devils were those who dived for him and did work other than that. And We were of them a guardian.

source: وأيوب إذ نادى ربه أني مسني الضر وأنت أرحم الراحمين
en: And [mention] Job, when he called to his Lord, "Indeed, adversity has touched me, and you are the Most Merciful of the merciful."

source: فاستجبنا له فكشفنا ما به من ضر وآتيناه أهله ومثلهم معهم رحمة من عندنا وذكرى للعابدين
en: So We responded to him and removed what afflicted him of adversity. And We gave him [back] his family and the like thereof with them as mercy from Us and a reminder for the worshippers [of Allah].

source: وإسماعيل وإدريس وذا الكفل كل من الصابرين
en: And [mention] Ishmael and Idrees and Dhul-Kifl; all were of the patient.

source: وأدخلناهم في رحمتنا إنهم من الصالحين
en: And We admitted them into Our mercy. Indeed, they were of the righteous.

source: وذا النون إذ ذهب مغاضبا فظن أن لن نقدر عليه فنادى في الظلمات أن لا إله إلا أنت سبحانك إني كنت من الظالمين
en: And [mention] the man of the fish, when he went off in anger and thought that We would not decree [anything] upon him. And he called out within the darknesses, "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers."

source: فاستجبنا له ونجيناه من الغم وكذلك ننجي المؤمنين
en: So We responded to him and saved him from the distress. And thus do We save the believers.

source: وزكريا إذ نادى ربه رب لا تذرني فردا وأنت خير الوارثين
en: And [mention] Zechariah, when he called to his Lord, "My Lord, do not leave me alone [with no heir], while you are the best of inheritors."

source: فاستجبنا له ووهبنا له يحيى وأصلحنا له زوجه إنهم كانوا يسارعون في الخيرات ويدعوننا رغبا ورهبا وكانوا لنا خاشعين
en: So We responded to him, and We gave to him John, and amended for him his wife. Indeed, they used to hasten to good deeds and supplicate Us in hope and fear, and they were to Us humbly submissive.

source: والتي أحصنت فرجها فنفخنا فيها من روحنا وجعلناها وابنها آية للعالمين
en: And [mention] the one who guarded her chastity, so We blew into her [garment] through Our angel [Gabriel], and We made her and her son a sign for the worlds.

source: إن هذه أمتكم أمة واحدة وأنا ربكم فاعبدون
en: Indeed this, your religion, is one religion, and I am your Lord, so worship Me.

source: وتقطعوا أمرهم بينهم كل إلينا راجعون
en: And [yet] they divided their affair among themselves, [but] all to Us will return.

source: فمن يعمل من الصالحات وهو مؤمن فلا كفران لسعيه وإنا له كاتبون
en: So whoever does righteous deeds while he is a believer - no denial will there be for his effort, and indeed We, of it, are recorders.

source: وحرام على قرية أهلكناها أنهم لا يرجعون
en: And there is prohibition upon [the people of] a city which We have destroyed that they will [ever] return

source: حتى إذا فتحت يأجوج ومأجوج وهم من كل حدب ينسلون
en: Until when [the dam of] Gog and Magog has been opened and they, from every elevation, descend

source: واقترب الوعد الحق فإذا هي شاخصة أبصار الذين كفروا يا ويلنا قد كنا في غفلة من هذا بل كنا ظالمين
en: And [when] the true promise has approached; then suddenly the eyes of those who disbelieved will be staring [in horror, while they say], "O woe to us; we had been unmindful of this; rather, we were wrongdoers."

source: إنكم وما تعبدون من دون الله حصب جهنم أنتم لها واردون
en: Indeed, you [disbelievers] and what you worship other than Allah are the firewood of Hell. You will be coming to [enter] it.

source: لو كان هؤلاء آلهة ما وردوها وكل فيها خالدون
en: Had these [false deities] been [actual] gods, they would not have come to it, but all are eternal therein.

source: لهم فيها زفير وهم فيها لا يسمعون
en: For them therein is heavy sighing, and they therein will not hear.

source: إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون
en: Indeed, those for whom the best [reward] has preceded from Us - they are from it far removed.

source: لا يسمعون حسيسها وهم في ما اشتهت أنفسهم خالدون
en: They will not hear its sound, while they are, in that which their souls desire, abiding eternally.

source: لا يحزنهم الفزع الأكبر وتتلقاهم الملائكة هذا يومكم الذي كنتم توعدون
en: They will not be grieved by the greatest terror, and the angels will meet them, [saying], "This is your Day which you have been promised" -

source: يوم نطوي السماء كطي السجل للكتب كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين
en: The Day when We will fold the heaven like the folding of a [written] sheet for the records. As We began the first creation, We will repeat it. [That is] a promise binding upon Us. Indeed, We will do it.

source: ولقد كتبنا في الزبور من بعد الذكر أن الأرض يرثها عبادي الصالحون
en: And We have already written in the book [of Psalms] after the [previous] mention that the land [of Paradise] is inherited by My righteous servants.

source: إن في هذا لبلاغا لقوم عابدين
en: Indeed, in this [Qur'an] is notification for a worshipping people.

source: وما أرسلناك إلا رحمة للعالمين
en: And We have not sent you, [O Muhammad], except as a mercy to the worlds.

source: قل إنما يوحى إلي أنما إلهكم إله واحد فهل أنتم مسلمون
en: Say, "It is only revealed to me that your god is but one God; so will you be Muslims [in submission to Him]?"

source: فإن تولوا فقل آذنتكم على سواء وإن أدري أقريب أم بعيد ما توعدون
en: But if they turn away, then say, "I have announced to [all of] you equally. And I know not whether near or far is that which you are promised.

source: إنه يعلم الجهر من القول ويعلم ما تكتمون
en: Indeed, He knows what is declared of speech, and He knows what you conceal.

source: وإن أدري لعله فتنة لكم ومتاع إلى حين
en: And I know not; perhaps it is a trial for you and enjoyment for a time."

source: قال رب احكم بالحق وربنا الرحمن المستعان على ما تصفون
en: [The Prophet] has said, "My Lord, judge [between us] in truth. And our Lord is the Most Merciful, the one whose help is sought against that which you describe."

source: يا أيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم
en: O mankind, fear your Lord. Indeed, the convulsion of the [final] Hour is a terrible thing.

source: يوم ترونها تذهل كل مرضعة عما أرضعت وتضع كل ذات حمل حملها وترى الناس سكارى وما هم بسكارى ولكن عذاب الله شديد
en: On the Day you see it every nursing mother will be distracted from that [child] she was nursing, and every pregnant woman will abort her pregnancy, and you will see the people [appearing] intoxicated while they are not intoxicated; but the punishment of Allah is severe.

source: ومن الناس من يجادل في الله بغير علم ويتبع كل شيطان مريد
en: And of the people is he who disputes about Allah without knowledge and follows every rebellious devil.

source: كتب عليه أنه من تولاه فأنه يضله ويهديه إلى عذاب السعير
en: It has been decreed for every devil that whoever turns to him - he will misguide him and will lead him to the punishment of the Blaze.

source: يا أيها الناس إن كنتم في ريب من البعث فإنا خلقناكم من تراب ثم من نطفة ثم من علقة ثم من مضغة مخلقة وغير مخلقة لنبين لكم ونقر في الأرحام ما نشاء إلى أجل مسمى ثم نخرجكم طفلا ثم لتبلغوا أشدكم ومنكم من يتوفى ومنكم من يرد إلى أرذل العمر لكيلا يعلم من بعد علم شيئا وترى الأرض هامدة فإذا أنزلنا عليها الماء اهتزت وربت وأنبتت من كل زوج بهيج
en: O People, if you should be in doubt about the Resurrection, then [consider that] indeed, We created you from dust, then from a sperm-drop, then from a clinging clot, and then from a lump of flesh, formed and unformed - that We may show you. And We settle in the wombs whom We will for a specified term, then We bring you out as a child, and then [We develop you] that you may reach your [time of] maturity. And among you is he who is taken in [early] death, and among you is he who is returned to the most decrepit [old] age so that he knows, after [once having] knowledge, nothing. And you see the earth barren, but when We send down upon it rain, it quivers and swells and grows [something] of every beautiful kind.

source: ذلك بأن الله هو الحق وأنه يحيي الموتى وأنه على كل شيء قدير
en: That is because Allah is the Truth and because He gives life to the dead and because He is over all things competent

source: وأن الساعة آتية لا ريب فيها وأن الله يبعث من في القبور
en: And [that they may know] that the Hour is coming - no doubt about it - and that Allah will resurrect those in the graves.

source: ومن الناس من يجادل في الله بغير علم ولا هدى ولا كتاب منير
en: And of the people is he who disputes about Allah without knowledge or guidance or an enlightening book [from Him],

source: ثاني عطفه ليضل عن سبيل الله له في الدنيا خزي ونذيقه يوم القيامة عذاب الحريق
en: Twisting his neck [in arrogance] to mislead [people] from the way of Allah. For him in the world is disgrace, and We will make him taste on the Day of Resurrection the punishment of the Burning Fire [while it is said],

source: ذلك بما قدمت يداك وأن الله ليس بظلام للعبيد
en: "That is for what your hands have put forth and because Allah is not ever unjust to [His] servants."

source: ومن الناس من يعبد الله على حرف فإن أصابه خير اطمأن به وإن أصابته فتنة انقلب على وجهه خسر الدنيا والآخرة ذلك هو الخسران المبين
en: And of the people is he who worships Allah on an edge. If he is touched by good, he is reassured by it; but if he is struck by trial, he turns on his face [to the other direction]. He has lost [this] world and the Hereafter. That is what is the manifest loss.

source: يدعو من دون الله ما لا يضره وما لا ينفعه ذلك هو الضلال البعيد
en: He invokes instead of Allah that which neither harms him nor benefits him. That is what is the extreme error.

source: يدعو لمن ضره أقرب من نفعه لبئس المولى ولبئس العشير
en: He invokes one whose harm is closer than his benefit - how wretched the protector and how wretched the associate.

source: إن الله يدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار إن الله يفعل ما يريد
en: Indeed, Allah will admit those who believe and do righteous deeds to gardens beneath which rivers flow. Indeed, Allah does what He intends.

source: من كان يظن أن لن ينصره الله في الدنيا والآخرة فليمدد بسبب إلى السماء ثم ليقطع فلينظر هل يذهبن كيده ما يغيظ
en: Whoever should think that Allah will not support [Prophet Muhammad] in this world and the Hereafter - let him extend a rope to the ceiling, then cut off [his breath], and let him see: will his effort remove that which enrages [him]?

source: وكذلك أنزلناه آيات بينات وأن الله يهدي من يريد
en: And thus have We sent the Qur'an down as verses of clear evidence and because Allah guides whom He intends.

source: إن الذين آمنوا والذين هادوا والصابئين والنصارى والمجوس والذين أشركوا إن الله يفصل بينهم يوم القيامة إن الله على كل شيء شهيد
en: Indeed, those who have believed and those who were Jews and the Sabeans and the Christians and the Magians and those who associated with Allah - Allah will judge between them on the Day of Resurrection. Indeed Allah is, over all things, Witness.

source: ألم تر أن الله يسجد له من في السماوات ومن في الأرض والشمس والقمر والنجوم والجبال والشجر والدواب وكثير من الناس وكثير حق عليه العذاب ومن يهن الله فما له من مكرم إن الله يفعل ما يشاء
en: Do you not see that to Allah prostrates whoever is in the heavens and whoever is on the earth and the sun, the moon, the stars, the mountains, the trees, the moving creatures and many of the people? But upon many the punishment has been justified. And he whom Allah humiliates - for him there is no bestower of honor. Indeed, Allah does what He wills.

source: هذان خصمان اختصموا في ربهم فالذين كفروا قطعت لهم ثياب من نار يصب من فوق رءوسهم الحميم
en: These are two adversaries who have disputed over their Lord. But those who disbelieved will have cut out for them garments of fire. Poured upon their heads will be scalding water

source: يصهر به ما في بطونهم والجلود
en: By which is melted that within their bellies and [their] skins.

source: ولهم مقامع من حديد
en: And for [striking] them are maces of iron.
